xcweaver/socialnetwork/evaluation/gcp/2024-08-07_02:27:25/workload.out
Running 5m test @ http://34.159.225.15:12345/wrk2-api/post/compose
  20 threads and 20 connections
  Thread calibration: mean lat.: 60.989ms, rate sampling interval: 267ms
  Thread calibration: mean lat.: 85.444ms, rate sampling interval: 403ms
  Thread calibration: mean lat.: 66.324ms, rate sampling interval: 317ms
  Thread calibration: mean lat.: 59.820ms, rate sampling interval: 277ms
  Thread calibration: mean lat.: 61.415ms, rate sampling interval: 224ms
  Thread calibration: mean lat.: 58.247ms, rate sampling interval: 255ms
  Thread calibration: mean lat.: 69.099ms, rate sampling interval: 334ms
  Thread calibration: mean lat.: 68.574ms, rate sampling interval: 292ms
  Thread calibration: mean lat.: 62.419ms, rate sampling interval: 305ms
  Thread calibration: mean lat.: 56.308ms, rate sampling interval: 297ms
  Thread calibration: mean lat.: 56.476ms, rate sampling interval: 292ms
  Thread calibration: mean lat.: 67.210ms, rate sampling interval: 369ms
  Thread calibration: mean lat.: 60.791ms, rate sampling interval: 270ms
  Thread calibration: mean lat.: 47.623ms, rate sampling interval: 201ms
  Thread calibration: mean lat.: 65.882ms, rate sampling interval: 316ms
  Thread calibration: mean lat.: 69.915ms, rate sampling interval: 324ms
  Thread calibration: mean lat.: 63.115ms, rate sampling interval: 355ms
  Thread calibration: mean lat.: 60.693ms, rate sampling interval: 372ms
  Thread calibration: mean lat.: 60.776ms, rate sampling interval: 277ms
  Thread calibration: mean lat.: 67.032ms, rate sampling interval: 355ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    25.18s    30.17s    1.66m    80.44%
    Req/Sec     5.95      3.37    17.00     89.07%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.20s 
 75.000%   45.09s 
 90.000%    1.28m 
 99.000%    1.66m 
 99.900%    1.77m 
 99.990%    1.82m 
 99.999%    1.83m 
100.000%    1.83m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      13.151     0.000000            1         1.00
      93.695     0.100000         3749         1.11
     230.271     0.200000         7498         1.25
     754.687     0.300000        11248         1.43
    3600.383     0.400000        14996         1.67
   10199.039     0.500000        18749         2.00
   15024.127     0.550000        20619         2.22
   21135.359     0.600000        22497         2.50
   27656.191     0.650000        24368         2.86
   35913.727     0.700000        26246         3.33
   45088.767     0.750000        28117         4.00
   49807.359     0.775000        29061         4.44
   54460.415     0.800000        30000         5.00
   59703.295     0.825000        30930         5.71
   65175.551     0.850000        31867         6.67
   70647.807     0.875000        32811         8.00
   73465.855     0.887500        33272         8.89
   76546.047     0.900000        33746        10.00
   79364.095     0.912500        34217        11.43
   82378.751     0.925000        34681        13.33
   85590.015     0.937500        35147        16.00
   87097.343     0.943750        35387        17.78
   88670.207     0.950000        35623        20.00
   90111.999     0.956250        35848        22.86
   91815.935     0.962500        36086        26.67
   93454.335     0.968750        36319        32.00
   94306.303     0.971875        36438        35.56
   95158.271     0.975000        36555        40.00
   96010.239     0.978125        36672        45.71
   96862.207     0.981250        36791        53.33
   97845.247     0.984375        36908        64.00
   98238.463     0.985938        36961        71.11
   98762.751     0.987500        37027        80.00
   99155.967     0.989062        37080        91.43
   99811.327     0.990625        37138       106.67
  100532.223     0.992188        37199       128.00
  100859.903     0.992969        37227       142.22
  101253.119     0.993750        37256       160.00
  101646.335     0.994531        37284       182.86
  102105.087     0.995313        37318       213.33
  102563.839     0.996094        37342       256.00
  102760.447     0.996484        37360       284.44
  103022.591     0.996875        37371       320.00
  103415.807     0.997266        37386       365.71
  103743.487     0.997656        37401       426.67
  104202.239     0.998047        37416       512.00
  104595.455     0.998242        37423       568.89
  104923.135     0.998437        37430       640.00
  105644.031     0.998633        37438       731.43
  106102.783     0.998828        37445       853.33
  106561.535     0.999023        37453      1024.00
  106758.143     0.999121        37456      1137.78
  107020.287     0.999219        37459      1280.00
  107413.503     0.999316        37463      1462.86
  107741.183     0.999414        37468      1706.67
  108003.327     0.999512        37470      2048.00
  108199.935     0.999561        37472      2275.56
  108527.615     0.999609        37474      2560.00
  108593.151     0.999658        37476      2925.71
  108855.295     0.999707        37478      3413.33
  108920.831     0.999756        37479      4096.00
  109051.903     0.999780        37481      4551.11
  109051.903     0.999805        37481      5120.00
  109117.439     0.999829        37482      5851.43
  109182.975     0.999854        37483      6826.67
  109248.511     0.999878        37484      8192.00
  109248.511     0.999890        37484      9102.22
  109314.047     0.999902        37485     10240.00
  109314.047     0.999915        37485     11702.86
  109510.655     0.999927        37486     13653.33
  109510.655     0.999939        37486     16384.00
  109510.655     0.999945        37486     18204.44
  109707.263     0.999951        37487     20480.00
  109707.263     0.999957        37487     23405.71
  109707.263     0.999963        37487     27306.67
  109707.263     0.999969        37487     32768.00
  109707.263     0.999973        37487     36408.89
  109772.799     0.999976        37488     40960.00
  109772.799     1.000000        37488          inf
#[Mean    =    25179.111, StdDeviation   =    30169.030]
#[Max     =   109707.264, Total count    =        37488]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  39483 requests in 5.00m, 19.38MB read
Requests/sec:    131.60
Transfer/sec:     66.16KB
